performance/performance-test.yml
# Artillery Performance Test Configuration
# Comprehensive performance testing for the Mall Admin System

config:
  target: 'http://localhost:3001'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 300
      arrivalRate: 25
      name: "Load test"
    - duration: 120
      arrivalRate: 50
      name: "Spike test"
    - duration: 180
      arrivalRate: 5
      name: "Cool down"
  
  defaults:
    headers:
      'Content-Type': 'application/json'
      'User-Agent': 'Artillery/Performance-Test'
  
  processor: './stress-processor.js'
  
  # Performance thresholds
  ensure:
    maxErrorRate: 5          # Max 5% error rate
    maxResponseTime: 2000    # Max 2 second response time
    minRequestRate: 20       # Min 20 requests per second

scenarios:
  - name: "Authentication Performance"
    weight: 20
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "shop.owner@test.com"
            password: "password123"
          capture:
            json: "$.token"
            as: "authToken"
      - function: "validateResponseTime"
      - get:
          url: "/api/v1/auth/profile"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - function: "recordCustomMetrics"

  - name: "Shop Management Performance"
    weight: 25
    flow:
      - function: "authenticateUser"
      - get:
          url: "/api/v1/shops/profile"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - get:
          url: "/api/v1/shops/analytics"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - get:
          url: "/api/v1/shops/dashboard"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - function: "monitorMemoryUsage"

  - name: "Product Operations Performance"
    weight: 30
    flow:
      - function: "authenticateUser"
      - function: "generateTestData"
      - get:
          url: "/api/v1/products"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - post:
          url: "/api/v1/products"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json: "{{ testProduct }}"
          capture:
            json: "$.data.id"
            as: "productId"
      - get:
          url: "/api/v1/products/{{ productId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - put:
          url: "/api/v1/products/{{ productId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            name: "Updated {{ testProduct.name }}"
            price: "{{ testProduct.price }}"
      - function: "handleError"

  - name: "Search and Filter Performance"
    weight: 15
    flow:
      - function: "authenticateUser"
      - get:
          url: "/api/v1/products/search"
          qs:
            q: "electronics"
            category: "all"
            page: 1
            limit: 20
          headers:
            Authorization: "Bearer {{ authToken }}"
      - get:
          url: "/api/v1/products"
          qs:
            category: "fashion"
            sort: "price"
            order: "asc"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - function: "validateResponseTime"

  - name: "Analytics Performance"
    weight: 10
    flow:
      - function: "authenticateUser"
      - get:
          url: "/api/v1/shops/analytics"
          qs:
            period: "7days"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - get:
          url: "/api/v1/shops/analytics"
          qs:
            period: "30days"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - function: "recordCustomMetrics"